package com.example.bean.cmb.product;

/**
 *
 * Created by owm on 2017/8/24.
 */

public class ProductResult {
    /**
     * body : {"btnText":"立即购买","productNo":"9917081400184","merOnegoType":"3","maxOfUser":"50","strNo":"0020000690016","maxOfOrder":"9","rushBeginTime":"","recommend":"","signOfRushToday":"","rushEndTime":"","isCanReturn":"0","totalRec":"11","isOneGo":"0","distance":"0.05688660247164543","stock":"499056","isCanAutoReturn":"0","ticketPrice":"","servicePhone":"020-34042630","longitude":"113.313749","merLogo":"https://piao-cdn.o2o.cmbchina.com/images/20170614-171429_200_150_002000069.jpg","merNo":"002000069","btnStatus":"2","onegoPayDiscountList":[{"onegoPayDiscountName":"和你一起红，一招过买单随机立减","onegoPayDiscountDetailInfo":"【活动时间】 2017.08.01--2017.08.24\n【活动规则】 1、本活动仅限掌上生活App（V5.5.5及以上版本）饭票版块同时含\u201c招\u201d和\u201c促\u201d标识的代金券活动商品参加。 \n2、本活动参与的门店信息可点击活动商品\u201c全部门店信息\u201d栏位查询。 \n3、活动期间，客户一招过买单余额单笔最低减0元，最高减77元，随机立减金额不高于客户该笔一招过买单余额。 \n4、活动期间，同一客户可累计参与10次，同一手机号、同一证件号（符合以上任一条件）均视为同一客户，参与次数和交易时间以招商银行系统记录为准，如发生退货交易，活动参与资格不另行补偿。活动名额有限，优惠是否享受以掌上生活App一招过买单完成后实际支付结果显示为准。活动过程中如发现违规行为（包括但不限于套现、虚假消费等交易）而有碍于其他客户公平参与本次活动，我行有权取消有此行为的客户参与活动的资格，并扣除参与活动所获得的立减金额。 \n5、一招过买单请登录掌上生活App，在已购买的代金券（查询路径：我的\u2014订单\u2022票券\u2014饭票\u2022本地优惠）中点击\u201c一招过买单\u201d。通过一招过买单的消费仅支持消费当日全单退货，退货金额为客户实际支付金额，不包含立减金额，商户按客户实际支付金额开具发票。 \n6、在法律允许的范围内，招商银行信用卡中心有权根据需要增删或修订本活动的条款（包括但不限于活动时间、参与方式及统计方式等），增删或修订经相关途径（如招商银行信用卡网站或招商银行信用卡掌上生活App）公告后生效。"}],"creditCardOfCmbPri":"","corner":"","productPicUrl":"https://piao-cdn.o2o.cmbchina.com/images/20161009-112220_640_232_72ffc2fd60074407be129e6df45eb218.jpg","prdStock":"","rows":[{"salesPrice":"100","salesPricePoint":"","signOfPriceType":"1111"}],"validityPerEnd":"2017-08-31","bakNo":"991708140018400004","strName":"卡朋（289艺术园店）","dimension":"23.124059","address":"广州市越秀区大道289号289艺术园","mainCountDown":"17:39:19","quantitySold":"5911","detailInfo":"［饭后电影，吃货必备］新户立享9元观影；新老户在线选座优惠后再立减10元；广州7家万达影院Imax立减20元。赶紧点击影票选座吧！\n1、100元可购买卡朋西餐厅110元代金券1张，数量有限，购完即止；\n2、每位客户最多可购买50张，可叠加使用，凭代金劵验证码至卡朋西餐厅广州指定门店（门店信息点击\u201c查看适用门店\u201d）经验证后使用，一经验证使用不可退款；\n3、代金劵有效期至2017年8月31日，有效期内未使用客户可自行在招商银行APP申请退款；此劵不兑现金、不找零，优惠劵抵用部分不提供发票；\n4、代金劵是否抢兑成功以最终收到验证码为准；验证码是否已使用以商户验证核实为准；\n5、本劵不限时段使用，重大节假日是否能使用请咨询商户为准，使用时间以商户公布的实际经营时间为准，无需预约，消费高峰时可能需要等位；\n6、本券不支持外送服务，本券代金券不能与午夜茶套餐、实体现金券、团购现金券、支付宝优惠同时使用，可以与周一摇一摇的产品优惠券同时使用，卡朋会员使用代金券时可享受会员价和会员积分；\n7、招商银行活动咨询电话：020-28095555，咨询时间：工作日9:00-12:00,14:00-18:00；\n【使用规则】本券只限一招过买单，当使用代金券时，券面金额不高于消费总金额\n【使用流程】该券购买成功后，打开已购买的代金券（路径：\u201c我的\u201d-\u201c订单.票券\u201d-\u201c饭票\u201d），点击下方\u201c一招过买单\u201d，按照提示输入消费总金额，掌上生活将会自动优先抵扣已购买的代金券，并在线付掉零钱部分，手机界面显示\u201d支付成功\u201c即表示完成了全单支付","validityPerBegin":"2017-07-01","isCanRush":"1","productName":"卡朋西餐厅110元代金券"}
     * syshead : {"session_id":"null","trans_code":"SI_PRD0017","chnl_id":"01","rsp_code":"0000000000","rsp_msg":"sucess"}
     */
    public Product body;
    public SysheadBean syshead;
}
